# Create a Pandas DataFrame

In [640]:
import pandas as pd
import numpy as np

#### code1 List of strings.

In [641]:
lst = ['Govind','Ankush','Sunil','Neeta','Rinku']
df = pd.DataFrame(lst)
df

        0
0  Govind
1  Ankush
2   Sunil
3   Neeta
4   Rinku

#### code2 DataFrame using list with index and column names.

In [642]:
lst = ['Govind','Ankush','Sunil','Neeta','Rinku']
df = pd.DataFrame(lst,index=['A','B','C','D','E'],columns = ['Names'])
df

    Names
A  Govind
B  Ankush
C   Sunil
D   Neeta
E   Rinku

#### code3 Using zip() for zipping two lists. i.e adding two lists in DataFrame.

In [643]:
lst = ['Govind','Ankush','Sunil','Neeta','Rinku']
lst1 = [11,22,33,44,55]
df = pd.DataFrame(list(zip(lst,lst1)),index=['A','B','C','D','E'], columns = ['Names','Values'])
df

    Names  Values
A  Govind      11
B  Ankush      22
C   Sunil      33
D   Neeta      44
E   Rinku      55

#### code4 Creating DataFrame using multi-dimensional list.

In [644]:
lst2 = [['Govind',11],['Ankush',22],['Sunil',33],['Neeta',44],['Rinku',55]]
df = pd.DataFrame(lst2,index=['A','B','C','D','E'], columns = ['Names','Values'])
df

    Names  Values
A  Govind      11
B  Ankush      22
C   Sunil      33
D   Neeta      44
E   Rinku      55

#### code5 Using Muilti-dimensional list with column name and dtype specified.

In [645]:
lst3 = [['Govind','Ankush','Sunil','Neeta','Rinku'],['Devke','Devke','Devke','Devke','Thevare'],[11,22,33,44,55]]
pd.DataFrame(lst3,index=['Names','Surname','Values'], columns = list('ABCDE'))
df

    Names  Values
A  Govind      11
B  Ankush      22
C   Sunil      33
D   Neeta      44
E   Rinku      55

#### code6 find total elements in the DataFrame

In [646]:
df.size

10

#### code7 find the dimension of the DataFrame

In [647]:
df.ndim

2

#### code8 find the total no. of rows and columns in DataFrame

In [648]:
df.shape

(5, 2)

#### code9 if we want the values of df in the form of array
df.values

#### code10

In [649]:
df.items

<bound method DataFrame.items of     Names  Values
A  Govind      11
B  Ankush      22
C   Sunil      33
D   Neeta      44
E   Rinku      55>

#### code11 Find the names of index in the DataFrame.

In [650]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

#### code12 Find the names of columns in the DataFrame.

In [651]:
df.columns

Index(['Names', 'Values'], dtype='object')

#### code13 Find top 3 entries in the DataFrame.

In [652]:
df.head(3)

    Names  Values
A  Govind      11
B  Ankush      22
C   Sunil      33

#### code14 Find last 3 entries in the DataFrame.

In [653]:
df.tail(3)

   Names  Values
C  Sunil      33
D  Neeta      44
E  Rinku      55

#### code15 Generate descriptive statistics of DataFrame.

In [654]:
df.describe()

          Values
count   5.000000
mean   33.000000
std    17.392527
min    11.000000
25%    22.000000
50%    33.000000
75%    44.000000
max    55.000000

#### code16 #Print a concise summary of a DataFrame.

In [655]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Names   5 non-null      object
 1   Values  5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 120.0+ bytes

#### code 17 it will tell u total missing values/NaN present in specific columns

In [656]:
df.isna().sum()

Names     0
Values    0
dtype: int64

In [657]:
df.isnull().sum()

Names     0
Values    0
dtype: int64

## Selection of Rows

In [658]:
data = {'Product':['Mobile','Ac','Laptop','TV','Football'],'Type':['Electronic','HomeAppliance','Electronic','HomeAppliance','Sport'],'Price':[10000,35000,50000,30000,790]}
data

{'Product': ['Mobile', 'Ac', 'Laptop', 'TV', 'Football'],
 'Type': ['Electronic',
  'HomeAppliance',
  'Electronic',
  'HomeAppliance',
  'Sport'],
 'Price': [10000, 35000, 50000, 30000, 790]}

In [659]:
df = pd.DataFrame(data)
df

    Product           Type  Price
0    Mobile     Electronic  10000
1        Ac  HomeAppliance  35000
2    Laptop     Electronic  50000
3        TV  HomeAppliance  30000
4  Football          Sport    790

#### code 1: Select the 'product' column in the DataFrame.

In [660]:
df['Product'] # it gives column in the form of Series

0      Mobile
1          Ac
2      Laptop
3          TV
4    Football
Name: Product, dtype: object

#### df['Product'].ndim # it gives dimensions of dataframe.

In [661]:
type(df['Product']) # it gives type of dataframe.

pandas.core.series.Series

In [662]:
df.Product # it gives column in the form of Series

0      Mobile
1          Ac
2      Laptop
3          TV
4    Football
Name: Product, dtype: object

In [663]:
df.Product.ndim # it gives dimensions of dataframe.

1

In [664]:
type(df.Product)  # it gives type of dataframe.

pandas.core.series.Series

In [665]:
df[['Product']] # it gives column in the form of DataFrame

    Product
0    Mobile
1        Ac
2    Laptop
3        TV
4  Football

In [666]:
df[['Product']].ndim # it gives dimensions of dataframe.

2

In [667]:
type(df[['Product']])  # it gives type of dataframe.

pandas.core.frame.DataFrame

## Indexing

#### Selection of Single column in dataframe

In [668]:
df['Product']#column names acts as an index

0      Mobile
1          Ac
2      Laptop
3          TV
4    Football
Name: Product, dtype: object

#### Selction of Multiple-columns in dataframe.

In [669]:
df[['Product','Price']]

    Product  Price
0    Mobile  10000
1        Ac  35000
2    Laptop  50000
3        TV  30000
4  Football    790

## Slicing

### if we are using slicing on DataFrame ==> we can fetch only rows==> not on columns.

In [670]:
df

    Product           Type  Price
0    Mobile     Electronic  10000
1        Ac  HomeAppliance  35000
2    Laptop     Electronic  50000
3        TV  HomeAppliance  30000
4  Football          Sport    790

### Fetching All the rows in the dataframe.

In [671]:
df[:]

    Product           Type  Price
0    Mobile     Electronic  10000
1        Ac  HomeAppliance  35000
2    Laptop     Electronic  50000
3        TV  HomeAppliance  30000
4  Football          Sport    790

In [672]:
df[:]

    Product           Type  Price
0    Mobile     Electronic  10000
1        Ac  HomeAppliance  35000
2    Laptop     Electronic  50000
3        TV  HomeAppliance  30000
4  Football          Sport    790

In [673]:
df[3:]

    Product           Type  Price
3        TV  HomeAppliance  30000
4  Football          Sport    790

In [674]:
df[:3]

  Product           Type  Price
0  Mobile     Electronic  10000
1      Ac  HomeAppliance  35000
2  Laptop     Electronic  50000

In [675]:
df[::2]

    Product        Type  Price
0    Mobile  Electronic  10000
2    Laptop  Electronic  50000
4  Football       Sport    790

## Indexing a DataFrame using.loc[ ]:
    1.This function selects data by the label of the rows and columns.
    2.The df.loc indexer selects data in a different way than just the indexing operator.
    3.It can select subsets of rows or columns.
    4.It can also simulataneously select subsets of rows and columns.
    5. In df.loc last values in slicing is inclusive.

### Selection of a single row

In [676]:
df

    Product           Type  Price
0    Mobile     Electronic  10000
1        Ac  HomeAppliance  35000
2    Laptop     Electronic  50000
3        TV  HomeAppliance  30000
4  Football          Sport    790

In [677]:
df1 = pd.DataFrame(data,index=['A','B','C','D','E'])
df1

    Product           Type  Price
A    Mobile     Electronic  10000
B        Ac  HomeAppliance  35000
C    Laptop     Electronic  50000
D        TV  HomeAppliance  30000
E  Football          Sport    790

In [678]:
df1.loc['B']

Product               Ac
Type       HomeAppliance
Price              35000
Name: B, dtype: object

### Selecting two rows and two columns

#### DataFrame.loc[['row1','row2'],['column1','column2','column3']]

In [679]:
df1.loc[['A','C'],['Product','Price']]

  Product  Price
A  Mobile  10000
C  Laptop  50000

### Selecting all of the rows and some columns

#### DataFrame.loc[:,['column1','column2','column3']]

In [680]:
df1.loc[:,['Type','Price']]

            Type  Price
A     Electronic  10000
B  HomeAppliance  35000
C     Electronic  50000
D  HomeAppliance  30000
E          Sport    790

## Indexing a DataFrame using.iloc[ ]:
    1.This functions allows us to retrive rows and columns by position.
    2.In order to do that, we'll need to specify the positions of the rows that we want, and the     positions of the columns that we want as well.
    3.The df.iloc indexer is very similar to df.loc but only uses integers locations to make its      selections.
    4.In df.iloc last values in slicing is exclusive.

### Selection of a single row

#### df1.iloc[row no.]

In [681]:
df1.iloc[1]

Product               Ac
Type       HomeAppliance
Price              35000
Name: B, dtype: object

### Selection of a Multiple rows

#### df1.iloc[[row no.1,row no.2,row no.3]]

In [682]:
df1.iloc[[0,2,4]]

    Product        Type  Price
A    Mobile  Electronic  10000
C    Laptop  Electronic  50000
E  Football       Sport    790

### Selecting two rows and two columns

#### df1.iloc[[row no.1,row no.2],[column no.1,column no.2]]

In [683]:
df1.iloc[[0,2],[0,2]]

  Product  Price
A  Mobile  10000
C  Laptop  50000

### Selecting all of the rows and some columns

#### df1.iloc[:,[column no.1,column no.2]]

In [684]:
df1.iloc[:,[1,2]]

            Type  Price
A     Electronic  10000
B  HomeAppliance  35000
C     Electronic  50000
D  HomeAppliance  30000
E          Sport    790

In [685]:
Player_list = [['M.S.Dhoni',36,75,5428000],['A.B.D Villers',38,74,3428000],['V.Kholi',31,70,8428000],['S.Smith',34,80,4428000],['C.Gayle',40,100,4528000],
              ['J.Root',33,72,7028000],['K.Peterson',42,85,2528000]]
Player_list

[['M.S.Dhoni', 36, 75, 5428000],
 ['A.B.D Villers', 38, 74, 3428000],
 ['V.Kholi', 31, 70, 8428000],
 ['S.Smith', 34, 80, 4428000],
 ['C.Gayle', 40, 100, 4528000],
 ['J.Root', 33, 72, 7028000],
 ['K.Peterson', 42, 85, 2528000]]

In [686]:
df = pd.DataFrame(Player_list,columns=['Name','Age','Weight','Salary'])
df

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kholi   31      70  8428000
3        S.Smith   34      80  4428000
4        C.Gayle   40     100  4528000
5         J.Root   33      72  7028000
6     K.Peterson   42      85  2528000

#### slicing rows in the data frames

In [687]:
df.loc[0:3]

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kholi   31      70  8428000
3        S.Smith   34      80  4428000

In [688]:
df.iloc[:4]

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kholi   31      70  8428000
3        S.Smith   34      80  4428000

#### slicing on columns

In [689]:
df.loc[:,['Name','Age']] # stop is inclusive

            Name  Age
0      M.S.Dhoni   36
1  A.B.D Villers   38
2        V.Kholi   31
3        S.Smith   34
4        C.Gayle   40
5         J.Root   33
6     K.Peterson   42

#### df.iloc[:,[0,1]] # stop is exclusive

In [690]:
df.iloc[:,0:2] # stop is exclusive

            Name  Age
0      M.S.Dhoni   36
1  A.B.D Villers   38
2        V.Kholi   31
3        S.Smith   34
4        C.Gayle   40
5         J.Root   33
6     K.Peterson   42

In [691]:
df[:2]

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000

In [692]:
df[2:]

         Name  Age  Weight   Salary
2     V.Kholi   31      70  8428000
3     S.Smith   34      80  4428000
4     C.Gayle   40     100  4528000
5      J.Root   33      72  7028000
6  K.Peterson   42      85  2528000

In [693]:
df[::2]

         Name  Age  Weight   Salary
0   M.S.Dhoni   36      75  5428000
2     V.Kholi   31      70  8428000
4     C.Gayle   40     100  4528000
6  K.Peterson   42      85  2528000

In [694]:
df[::-1]

            Name  Age  Weight   Salary
6     K.Peterson   42      85  2528000
5         J.Root   33      72  7028000
4        C.Gayle   40     100  4528000
3        S.Smith   34      80  4428000
2        V.Kholi   31      70  8428000
1  A.B.D Villers   38      74  3428000
0      M.S.Dhoni   36      75  5428000

In [695]:
df.iloc[:,1:2]

   Age
0   36
1   38
2   31
3   34
4   40
5   33
6   42

In [696]:
df.iloc[:,1]

0    36
1    38
2    31
3    34
4    40
5    33
6    42
Name: Age, dtype: int64

In [697]:
df.loc[3,:]

Name      S.Smith
Age            34
Weight         80
Salary    4428000
Name: 3, dtype: object

In [698]:
df.iloc[3,:]

Name      S.Smith
Age            34
Weight         80
Salary    4428000
Name: 3, dtype: object

In [699]:
df.loc[:,['Name','Salary']]

            Name   Salary
0      M.S.Dhoni  5428000
1  A.B.D Villers  3428000
2        V.Kholi  8428000
3        S.Smith  4428000
4        C.Gayle  4528000
5         J.Root  7028000
6     K.Peterson  2528000

In [700]:
df.iloc[:,1:4]

   Age  Weight   Salary
0   36      75  5428000
1   38      74  3428000
2   31      70  8428000
3   34      80  4428000
4   40     100  4528000
5   33      72  7028000
6   42      85  2528000

In [701]:
df.iloc[:,[1,3]]

   Age   Salary
0   36  5428000
1   38  3428000
2   31  8428000
3   34  4428000
4   40  4528000
5   33  7028000
6   42  2528000

## Addition of DataFrames using append
Pandas dataFrame.append() function is used to append rows of other dataframe to the end of the given dataframe, returning a new dataframe object.
Columns not in the original dataframes are added as new columns and the new cells are populated with NaN value.

In [702]:
Player_list = [['M.S.Dhoni',36,75,5428000],['A.B.D Villers',38,74,3428000],['V.Kholi',31,70,8428000],['S.Smith',34,80,4428000],['C.Gayle',40,100,4528000],
              ['J.Root',33,72,7028000],['K.Peterson',42,85,2528000]]
Player_list

[['M.S.Dhoni', 36, 75, 5428000],
 ['A.B.D Villers', 38, 74, 3428000],
 ['V.Kholi', 31, 70, 8428000],
 ['S.Smith', 34, 80, 4428000],
 ['C.Gayle', 40, 100, 4528000],
 ['J.Root', 33, 72, 7028000],
 ['K.Peterson', 42, 85, 2528000]]

In [703]:
df = pd.DataFrame(Player_list,columns=['Name','Age','Weight','Salary'])

In [704]:
df

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kholi   31      70  8428000
3        S.Smith   34      80  4428000
4        C.Gayle   40     100  4528000
5         J.Root   33      72  7028000
6     K.Peterson   42      85  2528000

In [705]:
data = {'Product':['Mobile','Ac','Laptop','TV','Football'],'Type':['Electronic','HomeAppliance','Electronic','HomeAppliance','Sport'],'Price':[10000,35000,50000,30000,790]}
data

{'Product': ['Mobile', 'Ac', 'Laptop', 'TV', 'Football'],
 'Type': ['Electronic',
  'HomeAppliance',
  'Electronic',
  'HomeAppliance',
  'Sport'],
 'Price': [10000, 35000, 50000, 30000, 790]}

In [706]:
df1 = pd.DataFrame(data)

In [707]:
df1

    Product           Type  Price
0    Mobile     Electronic  10000
1        Ac  HomeAppliance  35000
2    Laptop     Electronic  50000
3        TV  HomeAppliance  30000
4  Football          Sport    790

In [708]:
df.append

<bound method DataFrame.append of             Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kholi   31      70  8428000
3        S.Smith   34      80  4428000
4        C.Gayle   40     100  4528000
5         J.Root   33      72  7028000
6     K.Peterson   42      85  2528000>

In [709]:
df.append(df1)

            Name   Age  Weight     Salary   Product           Type    Price
0      M.S.Dhoni  36.0    75.0  5428000.0       NaN            NaN      NaN
1  A.B.D Villers  38.0    74.0  3428000.0       NaN            NaN      NaN
2        V.Kholi  31.0    70.0  8428000.0       NaN            NaN      NaN
3        S.Smith  34.0    80.0  4428000.0       NaN            NaN      NaN
4        C.Gayle  40.0   100.0  4528000.0       NaN            NaN      NaN
5         J.Root  33.0    72.0  7028000.0       NaN            NaN      NaN
6     K.Peterson  42.0    85.0  2528000.0       NaN            NaN      NaN
0            NaN   NaN     NaN        NaN    Mobile     Electronic  10000.0
1            NaN   NaN     NaN        NaN        Ac  HomeAppliance  35000.0
2            NaN   NaN     NaN        NaN    Laptop     Electronic  50000.0
3            NaN   NaN     NaN        NaN        TV  HomeAppliance  30000.0
4            NaN   NaN     NaN        NaN  Football          Sport    790.0

### A continuous index value will maintained across the rows in the new appended data frame use (ignore_index = True).

In [710]:
df.append(df1,ignore_index = True)

             Name   Age  Weight     Salary   Product           Type    Price
0       M.S.Dhoni  36.0    75.0  5428000.0       NaN            NaN      NaN
1   A.B.D Villers  38.0    74.0  3428000.0       NaN            NaN      NaN
2         V.Kholi  31.0    70.0  8428000.0       NaN            NaN      NaN
3         S.Smith  34.0    80.0  4428000.0       NaN            NaN      NaN
4         C.Gayle  40.0   100.0  4528000.0       NaN            NaN      NaN
5          J.Root  33.0    72.0  7028000.0       NaN            NaN      NaN
6      K.Peterson  42.0    85.0  2528000.0       NaN            NaN      NaN
7             NaN   NaN     NaN        NaN    Mobile     Electronic  10000.0
8             NaN   NaN     NaN        NaN        Ac  HomeAppliance  35000.0
9             NaN   NaN     NaN        NaN    Laptop     Electronic  50000.0
10            NaN   NaN     NaN        NaN        TV  HomeAppliance  30000.0
11            NaN   NaN     NaN        NaN  Football          Sport    790.0

In [711]:
df.append(df1,ignore_index = True).ndim

2

### Example 2: Append dataframe of different shape.

In [712]:
df5 = df1.append(df,ignore_index = True)
df5

     Product           Type    Price           Name   Age  Weight     Salary
0     Mobile     Electronic  10000.0            NaN   NaN     NaN        NaN
1         Ac  HomeAppliance  35000.0            NaN   NaN     NaN        NaN
2     Laptop     Electronic  50000.0            NaN   NaN     NaN        NaN
3         TV  HomeAppliance  30000.0            NaN   NaN     NaN        NaN
4   Football          Sport    790.0            NaN   NaN     NaN        NaN
5        NaN            NaN      NaN      M.S.Dhoni  36.0    75.0  5428000.0
6        NaN            NaN      NaN  A.B.D Villers  38.0    74.0  3428000.0
7        NaN            NaN      NaN        V.Kholi  31.0    70.0  8428000.0
8        NaN            NaN      NaN        S.Smith  34.0    80.0  4428000.0
9        NaN            NaN      NaN        C.Gayle  40.0   100.0  4528000.0
10       NaN            NaN      NaN         J.Root  33.0    72.0  7028000.0
11       NaN            NaN      NaN     K.Peterson  42.0    85.0  2528000.0

In [713]:
df1.append(df,ignore_index = True).ndim

2

In [714]:
df2 = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df3 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df4 = df2.append(df3)
df4

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [715]:
df4.ndim

2

## Delete row using drop
Pandas provide data analysts a way to delete and filter data frame using .drop() method.
Rows or columns can be removed using index label or column name using this method.

In [716]:
df5

     Product           Type    Price           Name   Age  Weight     Salary
0     Mobile     Electronic  10000.0            NaN   NaN     NaN        NaN
1         Ac  HomeAppliance  35000.0            NaN   NaN     NaN        NaN
2     Laptop     Electronic  50000.0            NaN   NaN     NaN        NaN
3         TV  HomeAppliance  30000.0            NaN   NaN     NaN        NaN
4   Football          Sport    790.0            NaN   NaN     NaN        NaN
5        NaN            NaN      NaN      M.S.Dhoni  36.0    75.0  5428000.0
6        NaN            NaN      NaN  A.B.D Villers  38.0    74.0  3428000.0
7        NaN            NaN      NaN        V.Kholi  31.0    70.0  8428000.0
8        NaN            NaN      NaN        S.Smith  34.0    80.0  4428000.0
9        NaN            NaN      NaN        C.Gayle  40.0   100.0  4528000.0
10       NaN            NaN      NaN         J.Root  33.0    72.0  7028000.0
11       NaN            NaN      NaN     K.Peterson  42.0    85.0  2528000.0

### Temporary Changes in the data frame (temporary removes columns in the data frame)

In [717]:
df5.drop(['Product','Price'], axis = 1)

             Type           Name   Age  Weight     Salary
0      Electronic            NaN   NaN     NaN        NaN
1   HomeAppliance            NaN   NaN     NaN        NaN
2      Electronic            NaN   NaN     NaN        NaN
3   HomeAppliance            NaN   NaN     NaN        NaN
4           Sport            NaN   NaN     NaN        NaN
5             NaN      M.S.Dhoni  36.0    75.0  5428000.0
6             NaN  A.B.D Villers  38.0    74.0  3428000.0
7             NaN        V.Kholi  31.0    70.0  8428000.0
8             NaN        S.Smith  34.0    80.0  4428000.0
9             NaN        C.Gayle  40.0   100.0  4528000.0
10            NaN         J.Root  33.0    72.0  7028000.0
11            NaN     K.Peterson  42.0    85.0  2528000.0

In [718]:
df5

     Product           Type    Price           Name   Age  Weight     Salary
0     Mobile     Electronic  10000.0            NaN   NaN     NaN        NaN
1         Ac  HomeAppliance  35000.0            NaN   NaN     NaN        NaN
2     Laptop     Electronic  50000.0            NaN   NaN     NaN        NaN
3         TV  HomeAppliance  30000.0            NaN   NaN     NaN        NaN
4   Football          Sport    790.0            NaN   NaN     NaN        NaN
5        NaN            NaN      NaN      M.S.Dhoni  36.0    75.0  5428000.0
6        NaN            NaN      NaN  A.B.D Villers  38.0    74.0  3428000.0
7        NaN            NaN      NaN        V.Kholi  31.0    70.0  8428000.0
8        NaN            NaN      NaN        S.Smith  34.0    80.0  4428000.0
9        NaN            NaN      NaN        C.Gayle  40.0   100.0  4528000.0
10       NaN            NaN      NaN         J.Root  33.0    72.0  7028000.0
11       NaN            NaN      NaN     K.Peterson  42.0    85.0  2528000.0

### Inplace = True ( Permanantly removes columns from the data frame)

In [719]:
df5.drop(['Product','Price'], axis = 1, inplace = True)

In [720]:
df5

             Type           Name   Age  Weight     Salary
0      Electronic            NaN   NaN     NaN        NaN
1   HomeAppliance            NaN   NaN     NaN        NaN
2      Electronic            NaN   NaN     NaN        NaN
3   HomeAppliance            NaN   NaN     NaN        NaN
4           Sport            NaN   NaN     NaN        NaN
5             NaN      M.S.Dhoni  36.0    75.0  5428000.0
6             NaN  A.B.D Villers  38.0    74.0  3428000.0
7             NaN        V.Kholi  31.0    70.0  8428000.0
8             NaN        S.Smith  34.0    80.0  4428000.0
9             NaN        C.Gayle  40.0   100.0  4528000.0
10            NaN         J.Root  33.0    72.0  7028000.0
11            NaN     K.Peterson  42.0    85.0  2528000.0

# String Functions

In [721]:
import pandas as pd
s = pd.Series(['Sanjay   ','###Abhijeet','Maha#& dev','*** Pallavi ***','Govind$#$','Roh   it','S #$upriya'])
s

0          Sanjay
1        ###Abhijeet
2         Maha#& dev
3    *** Pallavi ***
4          Govind$#$
5           Roh   it
6         S #$upriya
dtype: object

In [722]:
df = pd.DataFrame(s,columns = ['Names'])

In [723]:
df

             Names
0        Sanjay
1      ###Abhijeet
2       Maha#& dev
3  *** Pallavi ***
4        Govind$#$
5         Roh   it
6       S #$upriya

In [724]:
#df.str.strip()

In [725]:
s

0          Sanjay
1        ###Abhijeet
2         Maha#& dev
3    *** Pallavi ***
4          Govind$#$
5           Roh   it
6         S #$upriya
dtype: object

In [726]:
s.str.strip()

0             Sanjay
1        ###Abhijeet
2         Maha#& dev
3    *** Pallavi ***
4          Govind$#$
5           Roh   it
6         S #$upriya
dtype: object

In [727]:
s.str.strip(' #$*')

0        Sanjay
1      Abhijeet
2    Maha#& dev
3       Pallavi
4        Govind
5      Roh   it
6    S #$upriya
dtype: object

In [728]:
s.str.replace('#& ','')

0          Sanjay
1        ###Abhijeet
2            Mahadev
3    *** Pallavi ***
4          Govind$#$
5           Roh   it
6         S #$upriya
dtype: object

In [729]:
s.str.replace(' ','').replace('#','')

0           Sanjay
1      ###Abhijeet
2        Maha#&dev
3    ***Pallavi***
4        Govind$#$
5            Rohit
6        S#$upriya
dtype: object

In [730]:
df

             Names
0        Sanjay
1      ###Abhijeet
2       Maha#& dev
3  *** Pallavi ***
4        Govind$#$
5         Roh   it
6       S #$upriya

In [731]:
df.Names.str.strip()

0             Sanjay
1        ###Abhijeet
2         Maha#& dev
3    *** Pallavi ***
4          Govind$#$
5           Roh   it
6         S #$upriya
Name: Names, dtype: object

In [732]:
df['Names'].str.strip()

0             Sanjay
1        ###Abhijeet
2         Maha#& dev
3    *** Pallavi ***
4          Govind$#$
5           Roh   it
6         S #$upriya
Name: Names, dtype: object

In [733]:
df.Names.str.replace(' ','')

0           Sanjay
1      ###Abhijeet
2        Maha#&dev
3    ***Pallavi***
4        Govind$#$
5            Rohit
6        S#$upriya
Name: Names, dtype: object

In [734]:
df.Names.str.strip('*')

0      Sanjay
1    ###Abhijeet
2     Maha#& dev
3       Pallavi
4      Govind$#$
5       Roh   it
6     S #$upriya
Name: Names, dtype: object

In [735]:
df.Names.str.lower()

0          sanjay
1        ###abhijeet
2         maha#& dev
3    *** pallavi ***
4          govind$#$
5           roh   it
6         s #$upriya
Name: Names, dtype: object

In [736]:
df.Names.str.upper()

0          SANJAY
1        ###ABHIJEET
2         MAHA#& DEV
3    *** PALLAVI ***
4          GOVIND$#$
5           ROH   IT
6         S #$UPRIYA
Name: Names, dtype: object

In [737]:
df.Names.str.title()

0          Sanjay
1        ###Abhijeet
2         Maha#& Dev
3    *** Pallavi ***
4          Govind$#$
5           Roh   It
6         S #$Upriya
Name: Names, dtype: object

In [738]:
df.Names.str.endswith('t')

0    False
1     True
2    False
3    False
4    False
5     True
6    False
Name: Names, dtype: bool

In [739]:
df.Names.str.startswith('G')

0    False
1    False
2    False
3    False
4     True
5    False
6    False
Name: Names, dtype: bool

## How to Add Row in DataFrame?

In [740]:
# List of Tuples
students = [ ('jack', 34, 'Sydeny' , 'Australia') ,
             ('Riti', 30, 'Delhi' , 'India' ) ,
             ('Vikas', 31, 'Mumbai' , 'India' ) ,
             ('Neelu', 32, 'Bangalore' , 'India' ) ,
             ('John', 16, 'New York' , 'US') ,
             ('Mike', 17, 'las vegas' , 'US')  ]
students

[('jack', 34, 'Sydeny', 'Australia'),
 ('Riti', 30, 'Delhi', 'India'),
 ('Vikas', 31, 'Mumbai', 'India'),
 ('Neelu', 32, 'Bangalore', 'India'),
 ('John', 16, 'New York', 'US'),
 ('Mike', 17, 'las vegas', 'US')]

In [741]:
df7 = pd.DataFrame(students,index = ['A','B','C','D','E','F'],columns = ['Name','Age','City','Country'])

In [742]:
df7

    Name  Age       City    Country
A   jack   34     Sydeny  Australia
B   Riti   30      Delhi      India
C  Vikas   31     Mumbai      India
D  Neelu   32  Bangalore      India
E   John   16   New York         US
F   Mike   17  las vegas         US

### using dataframe.append() and Dictionary

In [743]:
df7 = df7.append({'Name':'Govind','Age':33,'City':'Pune','Country':'India'}, ignore_index = True)

In [744]:
df7

     Name  Age       City    Country
0    jack   34     Sydeny  Australia
1    Riti   30      Delhi      India
2   Vikas   31     Mumbai      India
3   Neelu   32  Bangalore      India
4    John   16   New York         US
5    Mike   17  las vegas         US
6  Govind   33       Pune      India

### using dataframe.append() and Series

In [745]:
s1 = pd.Series(['Ankush',34,'AWB','India'])

In [746]:
s1

0    Ankush
1        34
2       AWB
3     India
dtype: object

In [747]:
df8 = df7.append(s1, ignore_index = True)

In [748]:
df8

     Name   Age       City    Country       0     1    2      3
0    jack  34.0     Sydeny  Australia     NaN   NaN  NaN    NaN
1    Riti  30.0      Delhi      India     NaN   NaN  NaN    NaN
2   Vikas  31.0     Mumbai      India     NaN   NaN  NaN    NaN
3   Neelu  32.0  Bangalore      India     NaN   NaN  NaN    NaN
4    John  16.0   New York         US     NaN   NaN  NaN    NaN
5    Mike  17.0  las vegas         US     NaN   NaN  NaN    NaN
6  Govind  33.0       Pune      India     NaN   NaN  NaN    NaN
7     NaN   NaN        NaN        NaN  Ankush  34.0  AWB  India

In [749]:
df7

     Name  Age       City    Country
0    jack   34     Sydeny  Australia
1    Riti   30      Delhi      India
2   Vikas   31     Mumbai      India
3   Neelu   32  Bangalore      India
4    John   16   New York         US
5    Mike   17  las vegas         US
6  Govind   33       Pune      India

In [750]:
s1 = pd.Series(['Ankush',34,'AWB','India'],index=["Name",'Age','City','Country'])

In [751]:
s1

Name       Ankush
Age            34
City          AWB
Country     India
dtype: object

In [752]:
df9 = df7.append(s1,ignore_index = True)

In [753]:
df9

     Name  Age       City    Country
0    jack   34     Sydeny  Australia
1    Riti   30      Delhi      India
2   Vikas   31     Mumbai      India
3   Neelu   32  Bangalore      India
4    John   16   New York         US
5    Mike   17  las vegas         US
6  Govind   33       Pune      India
7  Ankush   34        AWB      India

In [754]:
dict3 = {'Name':['Marathe','Tim','Rob','Georgia'],'Maths':[87,91,97,95],'Science':[83,99,84,76]}
dict3

{'Name': ['Marathe', 'Tim', 'Rob', 'Georgia'],
 'Maths': [87, 91, 97, 95],
 'Science': [83, 99, 84, 76]}

In [755]:
df10 = pd.DataFrame(dict3)

In [756]:
df10

      Name  Maths  Science
0  Marathe     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76

In [757]:
df11 = {'Name':'Amy','Maths':89,'Science':75}
df11

{'Name': 'Amy', 'Maths': 89, 'Science': 75}

In [758]:
df13 = df10.append(df11,ignore_index = True)

In [759]:
df13

      Name  Maths  Science
0  Marathe     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76
4      Amy     89       75

### Add Multiple Rows in DataFrame

In [760]:
dict4 = {'Name':['Amy','Maddy'], 'Maths':[65,60],'Science':[70,75]}

In [761]:
dict4

{'Name': ['Amy', 'Maddy'], 'Maths': [65, 60], 'Science': [70, 75]}

In [762]:
df14 = pd.DataFrame(dict4)

In [763]:
df14

    Name  Maths  Science
0    Amy     65       70
1  Maddy     60       75

In [764]:
df15 = pd.concat([df10,df14], ignore_index = True)

In [765]:
df15

      Name  Maths  Science
0  Marathe     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76
4      Amy     65       70
5    Maddy     60       75

In [766]:
#List of series

In [767]:
df9

     Name  Age       City    Country
0    jack   34     Sydeny  Australia
1    Riti   30      Delhi      India
2   Vikas   31     Mumbai      India
3   Neelu   32  Bangalore      India
4    John   16   New York         US
5    Mike   17  las vegas         US
6  Govind   33       Pune      India
7  Ankush   34        AWB      India

In [768]:
df9.columns

Index(['Name', 'Age', 'City', 'Country'], dtype='object')

In [769]:
listOfSeries = [pd.Series(['Raju', 21, 'Bangalore', 'India'], index=df9.columns ) ,
                pd.Series(['Sam', 22, 'Tokyo', 'Japan'], index=df9.columns ) ,
                pd.Series(['Rocky', 23, 'Las Vegas', 'US'], index=df9.columns ) ]
listOfSeries

[Name            Raju
 Age               21
 City       Bangalore
 Country        India
 dtype: object,
 Name         Sam
 Age           22
 City       Tokyo
 Country    Japan
 dtype: object,
 Name           Rocky
 Age               23
 City       Las Vegas
 Country           US
 dtype: object]

In [770]:
df16 = df9.append(listOfSeries,ignore_index=True)

In [771]:
df16

      Name  Age       City    Country
0     jack   34     Sydeny  Australia
1     Riti   30      Delhi      India
2    Vikas   31     Mumbai      India
3    Neelu   32  Bangalore      India
4     John   16   New York         US
5     Mike   17  las vegas         US
6   Govind   33       Pune      India
7   Ankush   34        AWB      India
8     Raju   21  Bangalore      India
9      Sam   22      Tokyo      Japan
10   Rocky   23  Las Vegas         US

### Add a row from one dataframe to other datafram¶

In [772]:
students = [ ('Rahul', 22, 'Sydeny' , 'Australia') ,
             ('Parul', 23, 'Pune' , 'India')  ]
students

[('Rahul', 22, 'Sydeny', 'Australia'), ('Parul', 23, 'Pune', 'India')]

In [773]:
df17 = pd.DataFrame(students, columns = df9.columns, index =['a','b'])
df17

    Name  Age    City    Country
a  Rahul   22  Sydeny  Australia
b  Parul   23    Pune      India

In [774]:
df18 = df16.append(df17,ignore_index=True)

In [775]:
df18

      Name  Age       City    Country
0     jack   34     Sydeny  Australia
1     Riti   30      Delhi      India
2    Vikas   31     Mumbai      India
3    Neelu   32  Bangalore      India
4     John   16   New York         US
5     Mike   17  las vegas         US
6   Govind   33       Pune      India
7   Ankush   34        AWB      India
8     Raju   21  Bangalore      India
9      Sam   22      Tokyo      Japan
10   Rocky   23  Las Vegas         US
11   Rahul   22     Sydeny  Australia
12   Parul   23       Pune      India

In [776]:
df19 = pd.DataFrame({'a':[1,2,3,4],'b':[5,6,7,8]})

In [777]:
df19

   a  b
0  1  5
1  2  6
2  3  7
3  4  8

In [778]:
df20 = pd.DataFrame({'a':[1,2,3],'b':[5,6,7]})
df20

   a  b
0  1  5
1  2  6
2  3  7

In [779]:
df21 = df19.append(df20)

In [780]:
df21

   a  b
0  1  5
1  2  6
2  3  7
3  4  8
0  1  5
1  2  6
2  3  7

In [781]:
df21 = df19.append(df20,ignore_index=True)

In [782]:
df21

   a  b
0  1  5
1  2  6
2  3  7
3  4  8
4  1  5
5  2  6
6  3  7

### Append DataFrame of Different Shape.

In [783]:
df22 = pd.DataFrame({'a':[1,2,3,4],'b':[5,6,7,8]})

In [784]:
df22

   a  b
0  1  5
1  2  6
2  3  7
3  4  8

In [785]:
df23 = pd.DataFrame({'a':[1,2,3],'b':[5,6,7],'c':[1,5,4]})

In [786]:
df23

   a  b  c
0  1  5  1
1  2  6  5
2  3  7  4

In [787]:
df24 = df22.append(df23,ignore_index=True)

In [788]:
df24

   a  b    c
0  1  5  NaN
1  2  6  NaN
2  3  7  NaN
3  4  8  NaN
4  1  5  1.0
5  2  6  5.0
6  3  7  4.0

## without append how to add rows

In [789]:
df18

      Name  Age       City    Country
0     jack   34     Sydeny  Australia
1     Riti   30      Delhi      India
2    Vikas   31     Mumbai      India
3    Neelu   32  Bangalore      India
4     John   16   New York         US
5     Mike   17  las vegas         US
6   Govind   33       Pune      India
7   Ankush   34        AWB      India
8     Raju   21  Bangalore      India
9      Sam   22      Tokyo      Japan
10   Rocky   23  Las Vegas         US
11   Rahul   22     Sydeny  Australia
12   Parul   23       Pune      India

### Add a new row at index k with values provided in list

In [790]:
df18.loc[12] = ['Smriti', 26, 'Bangalore', 'India']
df18

      Name  Age       City    Country
0     jack   34     Sydeny  Australia
1     Riti   30      Delhi      India
2    Vikas   31     Mumbai      India
3    Neelu   32  Bangalore      India
4     John   16   New York         US
5     Mike   17  las vegas         US
6   Govind   33       Pune      India
7   Ankush   34        AWB      India
8     Raju   21  Bangalore      India
9      Sam   22      Tokyo      Japan
10   Rocky   23  Las Vegas         US
11   Rahul   22     Sydeny  Australia
12  Smriti   26  Bangalore      India

### if index is already present thenit will overwrite data

In [791]:
df18.loc['gvd'] = ['Ram',33,'Mumbai','India']
df18

       Name  Age       City    Country
0      jack   34     Sydeny  Australia
1      Riti   30      Delhi      India
2     Vikas   31     Mumbai      India
3     Neelu   32  Bangalore      India
4      John   16   New York         US
5      Mike   17  las vegas         US
6    Govind   33       Pune      India
7    Ankush   34        AWB      India
8      Raju   21  Bangalore      India
9       Sam   22      Tokyo      Japan
10    Rocky   23  Las Vegas         US
11    Rahul   22     Sydeny  Australia
12   Smriti   26  Bangalore      India
gvd     Ram   33     Mumbai      India

### Add a new row at index position 2 with values provided in list

In [792]:
df18.iloc[2] =['Mukesh', 22, 'Chennai', 'India']
df18

       Name  Age       City    Country
0      jack   34     Sydeny  Australia
1      Riti   30      Delhi      India
2    Mukesh   22    Chennai      India
3     Neelu   32  Bangalore      India
4      John   16   New York         US
5      Mike   17  las vegas         US
6    Govind   33       Pune      India
7    Ankush   34        AWB      India
8      Raju   21  Bangalore      India
9       Sam   22      Tokyo      Japan
10    Rocky   23  Las Vegas         US
11    Rahul   22     Sydeny  Australia
12   Smriti   26  Bangalore      India
gvd     Ram   33     Mumbai      India

### I want to add entries/rows in between the present data frame

## Addition of columns

### 1. By declaring a new list as column.

In [793]:
data = {'Name':['Jai','Princi','Gaurav','Anuj'],'Height':
       [5.1,6.2,5.1,5.2],'Qualification':['Msc','MA','MSc','MSc']}
data

{'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
 'Height': [5.1, 6.2, 5.1, 5.2],
 'Qualification': ['Msc', 'MA', 'MSc', 'MSc']}

In [794]:
df25 = pd.DataFrame(data)

In [795]:
df25

     Name  Height Qualification
0     Jai     5.1           Msc
1  Princi     6.2            MA
2  Gaurav     5.1           MSc
3    Anuj     5.2           MSc

In [796]:
address = ['Delhi','Banglore','Chennai','Patna']

In [797]:
df25['Address'] = address

In [798]:
df25

     Name  Height Qualification   Address
0     Jai     5.1           Msc     Delhi
1  Princi     6.2            MA  Banglore
2  Gaurav     5.1           MSc   Chennai
3    Anuj     5.2           MSc     Patna

### 2.By using DataFrame.insert()

In [799]:
data = {'Name':['Jai','Princi','Gaurav','Anuj'],'Height':
       [5.1,6.2,5.1,5.2],'Qualification':['Msc','MA','MSc','MSc']}
data

{'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
 'Height': [5.1, 6.2, 5.1, 5.2],
 'Qualification': ['Msc', 'MA', 'MSc', 'MSc']}

In [800]:
df25

     Name  Height Qualification   Address
0     Jai     5.1           Msc     Delhi
1  Princi     6.2            MA  Banglore
2  Gaurav     5.1           MSc   Chennai
3    Anuj     5.2           MSc     Patna

In [801]:
df25.insert(2,'Age',[21,23,24,21],True)

In [802]:
df25

     Name  Height  Age Qualification   Address
0     Jai     5.1   21           Msc     Delhi
1  Princi     6.2   23            MA  Banglore
2  Gaurav     5.1   24           MSc   Chennai
3    Anuj     5.2   21           MSc     Patna

### 3.Using DataFrame.assign() method

In [803]:
df25

     Name  Height  Age Qualification   Address
0     Jai     5.1   21           Msc     Delhi
1  Princi     6.2   23            MA  Banglore
2  Gaurav     5.1   24           MSc   Chennai
3    Anuj     5.2   21           MSc     Patna

In [804]:
df25 = df25.assign(Country = ['India','India','India','India'])

In [805]:
df25

     Name  Height  Age Qualification   Address Country
0     Jai     5.1   21           Msc     Delhi   India
1  Princi     6.2   23            MA  Banglore   India
2  Gaurav     5.1   24           MSc   Chennai   India
3    Anuj     5.2   21           MSc     Patna   India

### 4.By using a Dictionary.

In [806]:
df25

     Name  Height  Age Qualification   Address Country
0     Jai     5.1   21           Msc     Delhi   India
1  Princi     6.2   23            MA  Banglore   India
2  Gaurav     5.1   24           MSc   Chennai   India
3    Anuj     5.2   21           MSc     Patna   India

In [807]:
weight = {50:'Jai',55:'Princi',60:'Gaurav',65:'Anuj'}

In [808]:
df25['Weight'] = weight

In [809]:
df25

     Name  Height  Age Qualification   Address Country  Weight
0     Jai     5.1   21           Msc     Delhi   India      50
1  Princi     6.2   23            MA  Banglore   India      55
2  Gaurav     5.1   24           MSc   Chennai   India      60
3    Anuj     5.2   21           MSc     Patna   India      65

### How to add column in between the dataFrame
### How to change name of column which is already present

## Delete a Single Column

In [810]:
df25

     Name  Height  Age Qualification   Address Country  Weight
0     Jai     5.1   21           Msc     Delhi   India      50
1  Princi     6.2   23            MA  Banglore   India      55
2  Gaurav     5.1   24           MSc   Chennai   India      60
3    Anuj     5.2   21           MSc     Patna   India      65

### 1.Delete a column by using pop() Method.

In [811]:
#df25['country']

#### DataFrame.pop("Name of column")

In [812]:
#df25.pop('country')

In [813]:
df25

     Name  Height  Age Qualification   Address Country  Weight
0     Jai     5.1   21           Msc     Delhi   India      50
1  Princi     6.2   23            MA  Banglore   India      55
2  Gaurav     5.1   24           MSc   Chennai   India      60
3    Anuj     5.2   21           MSc     Patna   India      65

### 2.Delete a column by using del() Method.

#### del DataFrame['Name of column']

In [814]:
del df25['Country']

In [815]:
df25

     Name  Height  Age Qualification   Address  Weight
0     Jai     5.1   21           Msc     Delhi      50
1  Princi     6.2   23            MA  Banglore      55
2  Gaurav     5.1   24           MSc   Chennai      60
3    Anuj     5.2   21           MSc     Patna      65

### 3.Delete a column by using drop() method.

#### dataFrame.drop(['Name of column'],axis=1)

In [816]:
df25.drop(['Weight'],axis=1)

     Name  Height  Age Qualification   Address
0     Jai     5.1   21           Msc     Delhi
1  Princi     6.2   23            MA  Banglore
2  Gaurav     5.1   24           MSc   Chennai
3    Anuj     5.2   21           MSc     Patna

### 4.Delete a column by using as index base.

#### DataFrame.drop(DataFrame.columns[[column index number]],axis=1])

In [817]:
df25.drop(df25.columns[[0]], axis =1)

   Height  Age Qualification   Address  Weight
0     5.1   21           Msc     Delhi      50
1     6.2   23            MA  Banglore      55
2     5.1   24           MSc   Chennai      60
3     5.2   21           MSc     Patna      65

## Delete Multiple Columns

### 1.Delete a Multiple column by using drop() method.

#### dataFrame.drop(['Name of column1''Name of column2],axis=1)

In [818]:
df25

     Name  Height  Age Qualification   Address  Weight
0     Jai     5.1   21           Msc     Delhi      50
1  Princi     6.2   23            MA  Banglore      55
2  Gaurav     5.1   24           MSc   Chennai      60
3    Anuj     5.2   21           MSc     Patna      65

In [819]:
df25.drop(['Age','Address'],axis=1)

     Name  Height Qualification  Weight
0     Jai     5.1           Msc      50
1  Princi     6.2            MA      55
2  Gaurav     5.1           MSc      60
3    Anuj     5.2           MSc      65

### 2.Delete a Multiple columns by using as index base.

#### DataFrame.drop(DataFrame.columns[[column index numbers]],axis=1])

In [820]:
df25

     Name  Height  Age Qualification   Address  Weight
0     Jai     5.1   21           Msc     Delhi      50
1  Princi     6.2   23            MA  Banglore      55
2  Gaurav     5.1   24           MSc   Chennai      60
3    Anuj     5.2   21           MSc     Patna      65

In [821]:
df25.drop(df25.columns[[0,2,5]],axis=1)

   Height Qualification   Address
0     5.1           Msc     Delhi
1     6.2            MA  Banglore
2     5.1           MSc   Chennai
3     5.2           MSc     Patna

### 3.Drop Columns from a DataFrame using iloc[ ] and drop( ) Method.

#### Remove all columns between a specific column to another columns.

#### DataFrame.drop(DataFrame.iloc[:,1:3].columns, inplace = True, axis=1)

In [822]:
df18

       Name  Age       City    Country
0      jack   34     Sydeny  Australia
1      Riti   30      Delhi      India
2    Mukesh   22    Chennai      India
3     Neelu   32  Bangalore      India
4      John   16   New York         US
5      Mike   17  las vegas         US
6    Govind   33       Pune      India
7    Ankush   34        AWB      India
8      Raju   21  Bangalore      India
9       Sam   22      Tokyo      Japan
10    Rocky   23  Las Vegas         US
11    Rahul   22     Sydeny  Australia
12   Smriti   26  Bangalore      India
gvd     Ram   33     Mumbai      India

In [823]:
df18.drop(df18.iloc[:,1:3].columns,inplace = True, axis=1)

In [824]:
df18

       Name    Country
0      jack  Australia
1      Riti      India
2    Mukesh      India
3     Neelu      India
4      John         US
5      Mike         US
6    Govind      India
7    Ankush      India
8      Raju      India
9       Sam      Japan
10    Rocky         US
11    Rahul  Australia
12   Smriti      India
gvd     Ram      India

### 4.Drop columns from a DataFrame using loc[ ] and drop() method.

#### DataFrame.drop(DataFrame.loc[:,'column name':'column name'].columns, inplace = True, axis=1)

In [825]:
df18

       Name    Country
0      jack  Australia
1      Riti      India
2    Mukesh      India
3     Neelu      India
4      John         US
5      Mike         US
6    Govind      India
7    Ankush      India
8      Raju      India
9       Sam      Japan
10    Rocky         US
11    Rahul  Australia
12   Smriti      India
gvd     Ram      India

In [826]:
df18.drop(df18.loc[:,'Name':'Country'].columns,axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, gvd]

In [827]:
data = {'A':['A1','A2','A3','A4','A5'],
       'B':['B1','B2','B3','B4','B5'],
       'C':['C1','C2','C3','C4','C5'],
       'D':['D1','D2','D3','D4','D5'],
       'E':['E1','E2','E3','E4','E5']}
data

{'A': ['A1', 'A2', 'A3', 'A4', 'A5'],
 'B': ['B1', 'B2', 'B3', 'B4', 'B5'],
 'C': ['C1', 'C2', 'C3', 'C4', 'C5'],
 'D': ['D1', 'D2', 'D3', 'D4', 'D5'],
 'E': ['E1', 'E2', 'E3', 'E4', 'E5']}

In [828]:
df26 = pd.DataFrame(data)

In [829]:
df26

    A   B   C   D   E
0  A1  B1  C1  D1  E1
1  A2  B2  C2  D2  E2
2  A3  B3  C3  D3  E3
3  A4  B4  C4  D4  E4
4  A5  B5  C5  D5  E5

In [830]:
df26.drop(['A'],axis=1)

    B   C   D   E
0  B1  C1  D1  E1
1  B2  C2  D2  E2
2  B3  C3  D3  E3
3  B4  C4  D4  E4
4  B5  C5  D5  E5

In [831]:
data = {'A':['A1','A2','A3','A4','A5'],
       'B':['B1','B2','B3','B4','B5'],
       'C':['C1','C2','C3','C4','C5'],
       'D':['D1','D2','D3','D4','D5'],
       'E':['E1','E2','E3','E4','E5']}
data

{'A': ['A1', 'A2', 'A3', 'A4', 'A5'],
 'B': ['B1', 'B2', 'B3', 'B4', 'B5'],
 'C': ['C1', 'C2', 'C3', 'C4', 'C5'],
 'D': ['D1', 'D2', 'D3', 'D4', 'D5'],
 'E': ['E1', 'E2', 'E3', 'E4', 'E5']}

In [832]:
df27 = pd.DataFrame(data)

In [833]:
df27

    A   B   C   D   E
0  A1  B1  C1  D1  E1
1  A2  B2  C2  D2  E2
2  A3  B3  C3  D3  E3
3  A4  B4  C4  D4  E4
4  A5  B5  C5  D5  E5

In [834]:
df27.drop(['B','C'],axis=1)

    A   D   E
0  A1  D1  E1
1  A2  D2  E2
2  A3  D3  E3
3  A4  D4  E4
4  A5  D5  E5

In [835]:
data = {'A':['A1','A2','A3','A4','A5'],
       'B':['B1','B2','B3','B4','B5'],
       'C':['C1','C2','C3','C4','C5'],
       'D':['D1','D2','D3','D4','D5'],
       'E':['E1','E2','E3','E4','E5']}
data

{'A': ['A1', 'A2', 'A3', 'A4', 'A5'],
 'B': ['B1', 'B2', 'B3', 'B4', 'B5'],
 'C': ['C1', 'C2', 'C3', 'C4', 'C5'],
 'D': ['D1', 'D2', 'D3', 'D4', 'D5'],
 'E': ['E1', 'E2', 'E3', 'E4', 'E5']}

In [836]:
df28 = pd.DataFrame(data)

In [837]:
df28

    A   B   C   D   E
0  A1  B1  C1  D1  E1
1  A2  B2  C2  D2  E2
2  A3  B3  C3  D3  E3
3  A4  B4  C4  D4  E4
4  A5  B5  C5  D5  E5

In [838]:
df28.drop(df28.columns[[0,4,2]], axis=1)

    B   D
0  B1  D1
1  B2  D2
2  B3  D3
3  B4  D4
4  B5  D5

In [839]:
data = {'A':['A1','A2','A3','A4','A5'],
       'B':['B1','B2','B3','B4','B5'],
       'C':['C1','C2','C3','C4','C5'],
       'D':['D1','D2','D3','D4','D5'],
       'E':['E1','E2','E3','E4','E5']}
data

{'A': ['A1', 'A2', 'A3', 'A4', 'A5'],
 'B': ['B1', 'B2', 'B3', 'B4', 'B5'],
 'C': ['C1', 'C2', 'C3', 'C4', 'C5'],
 'D': ['D1', 'D2', 'D3', 'D4', 'D5'],
 'E': ['E1', 'E2', 'E3', 'E4', 'E5']}

In [840]:
df30 = pd.DataFrame(data)

In [841]:
df30

    A   B   C   D   E
0  A1  B1  C1  D1  E1
1  A2  B2  C2  D2  E2
2  A3  B3  C3  D3  E3
3  A4  B4  C4  D4  E4
4  A5  B5  C5  D5  E5

In [842]:
df30.drop(df30.iloc[:,1:3].columns, inplace=True, axis=1)

In [843]:
df30

    A   D   E
0  A1  D1  E1
1  A2  D2  E2
2  A3  D3  E3
3  A4  D4  E4
4  A5  D5  E5

In [844]:
data = {'A':['A1','A2','A3','A4','A5'],
       'B':['B1','B2','B3','B4','B5'],
       'C':['C1','C2','C3','C4','C5'],
       'D':['D1','D2','D3','D4','D5'],
       'E':['E1','E2','E3','E4','E5']}
data

{'A': ['A1', 'A2', 'A3', 'A4', 'A5'],
 'B': ['B1', 'B2', 'B3', 'B4', 'B5'],
 'C': ['C1', 'C2', 'C3', 'C4', 'C5'],
 'D': ['D1', 'D2', 'D3', 'D4', 'D5'],
 'E': ['E1', 'E2', 'E3', 'E4', 'E5']}

In [845]:
df29 = pd.DataFrame(data)

In [846]:
df29

    A   B   C   D   E
0  A1  B1  C1  D1  E1
1  A2  B2  C2  D2  E2
2  A3  B3  C3  D3  E3
3  A4  B4  C4  D4  E4
4  A5  B5  C5  D5  E5

In [847]:
df29.drop(df29.loc[:,'B':'D'],inplace = True, axis=1)

In [848]:
df29

    A   E
0  A1  E1
1  A2  E2
2  A3  E3
3  A4  E4
4  A5  E5

In [849]:
data = {'A':['A1','A2','A3','A4','A5'],
       'B':['B1','B2','B3','B4','B5'],
       'C':['C1','C2','C3','C4','C5'],
       'D':['D1','D2','D3','D4','D5'],
       'E':['E1','E2','E3','E4','E5']}
data

{'A': ['A1', 'A2', 'A3', 'A4', 'A5'],
 'B': ['B1', 'B2', 'B3', 'B4', 'B5'],
 'C': ['C1', 'C2', 'C3', 'C4', 'C5'],
 'D': ['D1', 'D2', 'D3', 'D4', 'D5'],
 'E': ['E1', 'E2', 'E3', 'E4', 'E5']}

In [850]:
df31 = pd.DataFrame(data)

In [851]:
df31

    A   B   C   D   E
0  A1  B1  C1  D1  E1
1  A2  B2  C2  D2  E2
2  A3  B3  C3  D3  E3
3  A4  B4  C4  D4  E4
4  A5  B5  C5  D5  E5

In [852]:
for col in df31.columns:
    if 'A' in col:
        del df31[col]
df31

    B   C   D   E
0  B1  C1  D1  E1
1  B2  C2  D2  E2
2  B3  C3  D3  E3
3  B4  C4  D4  E4
4  B5  C5  D5  E5

#### How to delete a single row
#### how to delete collection of rows
#### how to delete random rows

## Summary: and apply statics on DataFrame

In [853]:
data={'Name':pd.Series(['Anju','Rimi','Amol','Amit','Shobha','Arnav','Abhi']),
       'Age':pd.Series([25,26,30,32,27,36,40]),
'Percentage':pd.Series([59.76,67.80,80,85,78.33,60,75])}

In [854]:
data

{'Name': 0      Anju
 1      Rimi
 2      Amol
 3      Amit
 4    Shobha
 5     Arnav
 6      Abhi
 dtype: object,
 'Age': 0    25
 1    26
 2    30
 3    32
 4    27
 5    36
 6    40
 dtype: int64,
 'Percentage': 0    59.76
 1    67.80
 2    80.00
 3    85.00
 4    78.33
 5    60.00
 6    75.00
 dtype: float64}

In [855]:
df32 = pd.DataFrame(data)

In [856]:
df32

     Name  Age  Percentage
0    Anju   25       59.76
1    Rimi   26       67.80
2    Amol   30       80.00
3    Amit   32       85.00
4  Shobha   27       78.33
5   Arnav   36       60.00
6    Abhi   40       75.00

### sum()

In [857]:
#default axis=0 (columnwise)

In [858]:
df32.sum()

Name          AnjuRimiAmolAmitShobhaArnavAbhi
Age                                       216
Percentage                             505.89
dtype: object

In [859]:
df32.sum(axis=0)

Name          AnjuRimiAmolAmitShobhaArnavAbhi
Age                                       216
Percentage                             505.89
dtype: object

In [860]:
df32.sum(axis=1)

C:\Users\DEVKE_~1\AppData\Local\Temp/ipykernel_4732/2642237712.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df32.sum(axis=1)

0     84.76
1     93.80
2    110.00
3    117.00
4    105.33
5     96.00
6    115.00
dtype: float64

### if i want only single column and i want to perform sum()

In [861]:
df32.Name.sum()

'AnjuRimiAmolAmitShobhaArnavAbhi'

In [862]:
df32['Name'].sum()

'AnjuRimiAmolAmitShobhaArnavAbhi'

In [863]:
df32.Age.sum()

216

In [864]:
df32["Age"].sum()

216

In [865]:
df32.Percentage.sum()

505.89

In [866]:
df32['Percentage'].sum()

505.89

In [867]:
df32[['Percentage']].sum()

Percentage    505.89
dtype: float64

### if i want to apply sum on both columns

In [868]:
df32[['Age','Percentage']].sum()

Age           216.00
Percentage    505.89
dtype: float64

In [869]:
df32.iloc[:,1:].sum()

Age           216.00
Percentage    505.89
dtype: float64

In [870]:
df32.loc[:,['Age','Percentage']].sum()

Age           216.00
Percentage    505.89
dtype: float64

In [871]:
df32.drop(columns=['Name']).sum()

Age           216.00
Percentage    505.89
dtype: float64

In [872]:
df32.sum()[['Age','Percentage']]

Age              216
Percentage    505.89
dtype: object

In [873]:
df32.Age.sum(),df32.Percentage.sum()

(216, 505.89)

In [874]:
df32['Age'].sum(),df32['Percentage'].sum()

(216, 505.89)

In [875]:
df32[['Age','Percentage']].sum(axis=1)

0     84.76
1     93.80
2    110.00
3    117.00
4    105.33
5     96.00
6    115.00
dtype: float64

### Mean()

In [876]:
df32.mean()

C:\Users\DEVKE_~1\AppData\Local\Temp/ipykernel_4732/1719568881.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df32.mean()

Age           30.857143
Percentage    72.270000
dtype: float64

In [877]:
df32.Age.mean()

30.857142857142858

In [878]:
df32['Age'].mean()

30.857142857142858

In [879]:
df32.mean()['Age']

C:\Users\DEVKE_~1\AppData\Local\Temp/ipykernel_4732/3013339117.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df32.mean()['Age']

30.857142857142858

In [880]:
df32.std()

C:\Users\DEVKE_~1\AppData\Local\Temp/ipykernel_4732/3193399846.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df32.std()

Age           5.550633
Percentage    9.941631
dtype: float64

In [881]:
df32.Age.std()

5.5506327395643655

In [882]:
df32.std()['Age']

C:\Users\DEVKE_~1\AppData\Local\Temp/ipykernel_4732/456627165.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df32.std()['Age']

5.5506327395643655

In [883]:
df32.std().Age

C:\Users\DEVKE_~1\AppData\Local\Temp/ipykernel_4732/604835965.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df32.std().Age

5.5506327395643655

In [884]:
df32['Age'].std()

5.5506327395643655

In [885]:
df32.median()

C:\Users\DEVKE_~1\AppData\Local\Temp/ipykernel_4732/2861859501.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df32.median()

Age           30.0
Percentage    75.0
dtype: float64

In [886]:
df32['Age'].median()

30.0

In [887]:
df32.Age.median()

30.0

In [888]:
df32.min()

Name           Abhi
Age              25
Percentage    59.76
dtype: object

In [889]:
df32.Age.min()

25

In [890]:
df32['Age'].min()

25

In [891]:
df32.min()['Age']

25

In [892]:
df32.cummax()

     Name  Age  Percentage
0    Anju   25       59.76
1    Rimi   26       67.80
2    Rimi   30       80.00
3    Rimi   32       85.00
4  Shobha   32       85.00
5  Shobha   36       85.00
6  Shobha   40       85.00

In [893]:
df32.cumsum()

                              Name  Age  Percentage
0                             Anju   25       59.76
1                         AnjuRimi   51      127.56
2                     AnjuRimiAmol   81      207.56
3                 AnjuRimiAmolAmit  113      292.56
4           AnjuRimiAmolAmitShobha  140      370.89
5      AnjuRimiAmolAmitShobhaArnav  176      430.89
6  AnjuRimiAmolAmitShobhaArnavAbhi  216      505.89

In [894]:
df33 = df32[['Age','Percentage']]

In [895]:
df33

   Age  Percentage
0   25       59.76
1   26       67.80
2   30       80.00
3   32       85.00
4   27       78.33
5   36       60.00
6   40       75.00

In [896]:
df33.cumsum()

   Age  Percentage
0   25       59.76
1   51      127.56
2   81      207.56
3  113      292.56
4  140      370.89
5  176      430.89
6  216      505.89

In [897]:
df33.cumprod()

           Age    Percentage
0           25  5.976000e+01
1          650  4.051728e+03
2        19500  3.241382e+05
3       624000  2.755175e+07
4     16848000  2.158129e+09
5    606528000  1.294877e+11
6  24261120000  9.711579e+12

In [898]:
df33.cummax()

   Age  Percentage
0   25       59.76
1   26       67.80
2   30       80.00
3   32       85.00
4   32       85.00
5   36       85.00
6   40       85.00

## Summarizing Data

In [899]:
df32.describe()

             Age  Percentage
count   7.000000    7.000000
mean   30.857143   72.270000
std     5.550633    9.941631
min    25.000000   59.760000
25%    26.500000   63.900000
50%    30.000000   75.000000
75%    34.000000   79.165000
max    40.000000   85.000000

In [900]:
df32.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        7 non-null      object
 1   Age         7 non-null      int64
 2   Percentage  7 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 296.0+ bytes

### dataframe.Transpose()

In [901]:
df32

     Name  Age  Percentage
0    Anju   25       59.76
1    Rimi   26       67.80
2    Amol   30       80.00
3    Amit   32       85.00
4  Shobha   27       78.33
5   Arnav   36       60.00
6    Abhi   40       75.00

In [902]:
df32.T

                0     1     2     3       4      5     6
Name         Anju  Rimi  Amol  Amit  Shobha  Arnav  Abhi
Age            25    26    30    32      27     36    40
Percentage  59.76  67.8  80.0  85.0   78.33   60.0  75.0

In [903]:
df32.describe().T[['min','max']]

              min   max
Age         25.00  40.0
Percentage  59.76  85.0

## dataframe.astype()

#### DataFrame.astype() method is used to cast a pandas object to a specified dtype.astype() function also provides the capability to convert any suitable existing column to categorical type.

In [904]:
a = pd.DataFrame([1.2,3.5,2.6,4.5,5.8,9.7])
a

     0
0  1.2
1  3.5
2  2.6
3  4.5
4  5.8
5  9.7

In [905]:
b = a.astype('int32')

In [906]:
b

   0
0  1
1  3
2  2
3  4
4  5
5  9

In [907]:
a.dtypes

0    float64
dtype: object

In [908]:
type(a)

pandas.core.frame.DataFrame

In [909]:
b.dtypes

0    int32
dtype: object

In [910]:
type(b)

pandas.core.frame.DataFrame

In [911]:
#import.csv file

In [912]:
import pandas as pd

In [913]:
df33 = pd.read_csv('Downloads/CSV/diabetes.csv')

In [914]:
df33

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [915]:
df33[:10]

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1
5,5,116,74,0,0,25.6,0.201,30,0
6,3,78,50,32,88,31.0,0.248,26,1
7,10,115,0,0,0,35.3,0.134,29,0
8,2,197,70,45,543,30.5,0.158,53,1
9,8,125,96,0,0,0.0,0.232,54,1

In [916]:
df33.dropna(inplace=True)

In [917]:
df33

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [918]:
type(df33.Glucose)

pandas.core.series.Series

In [919]:
(df33.Glucose).dtypes

dtype('int64')

In [920]:
df33 = df33.Glucose.astype('int32')

In [921]:
df33

0      148
1       85
2      183
3       89
4      137
      ...
763    101
764    122
765    121
766    126
767     93
Name: Glucose, Length: 768, dtype: int32

## dataframe.where(condition)

#### Pandas where() method is used to check a data frame for one or more condition and return the result accordingly. By Default,The rows not satisfying the condition are filled with NaN value.

#### Single Condition operation.

In [922]:
df34 = pd.read_csv('Downloads/CSV/diabetes.csv')

In [923]:
df34

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [924]:
df34.sort_values('Pregnancies', inplace = True)

In [925]:
df34

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
467,0,97,64,36,100,36.8,0.600,25,0
109,0,95,85,25,36,37.4,0.247,24,1
452,0,91,68,32,210,39.9,0.381,25,0
449,0,120,74,18,63,30.5,0.285,26,0
448,0,104,64,37,64,33.6,0.510,22,1
...,...,...,...,...,...,...,...,...,...
357,13,129,0,30,0,39.9,0.569,44,1
298,14,100,78,25,184,36.6,0.412,46,1
455,14,175,62,30,0,33.6,0.212,38,1
88,15,136,70,32,110,37.1,0.153,43,1
159,17,163,72,41,114,40.9,0.817,47,1

In [926]:
condition = df34['Pregnancies']>=10

In [927]:
df34.where(condition, inplace=True)

In [928]:
df34

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
467,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
109,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
452,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
449,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
448,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
357,13.0,129.0,0.0,30.0,0.0,39.9,0.569,44.0,1.0
298,14.0,100.0,78.0,25.0,184.0,36.6,0.412,46.0,1.0
455,14.0,175.0,62.0,30.0,0.0,33.6,0.212,38.0,1.0
88,15.0,136.0,70.0,32.0,110.0,37.1,0.153,43.0,1.0
159,17.0,163.0,72.0,41.0,114.0,40.9,0.817,47.0,1.0

### Muiti-conditions Operations

In [929]:
df35 = pd.read_csv('Downloads/CSV/diabetes.csv')

In [930]:
df35

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [931]:
df35.sort_values('Pregnancies', inplace=True)

In [932]:
df35

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
467,0,97,64,36,100,36.8,0.600,25,0
109,0,95,85,25,36,37.4,0.247,24,1
452,0,91,68,32,210,39.9,0.381,25,0
449,0,120,74,18,63,30.5,0.285,26,0
448,0,104,64,37,64,33.6,0.510,22,1
...,...,...,...,...,...,...,...,...,...
357,13,129,0,30,0,39.9,0.569,44,1
298,14,100,78,25,184,36.6,0.412,46,1
455,14,175,62,30,0,33.6,0.212,38,1
88,15,136,70,32,110,37.1,0.153,43,1
159,17,163,72,41,114,40.9,0.817,47,1

In [933]:
condition1 = df35['Pregnancies']>=10
condition2 = df35['BloodPressure']>=50

In [934]:
df35.where(condition1 & condition2,inplace=True)

In [935]:
df35

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
467,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
109,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
452,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
449,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
448,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
357,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
298,14.0,100.0,78.0,25.0,184.0,36.6,0.412,46.0,1.0
455,14.0,175.0,62.0,30.0,0.0,33.6,0.212,38.0,1.0
88,15.0,136.0,70.0,32.0,110.0,37.1,0.153,43.0,1.0
159,17.0,163.0,72.0,41.0,114.0,40.9,0.817,47.0,1.0

In [936]:
import pandas as pd
import numpy as np
df36 = pd.DataFrame(np.random.random((5,5)),columns=list('abcde'))
df36

          a         b         c         d         e
0  0.645975  0.594355  0.943314  0.617478  0.508472
1  0.227610  0.769437  0.347931  0.671099  0.746221
2  0.120658  0.549390  0.214769  0.479021  0.710810
3  0.414335  0.685167  0.520931  0.281643  0.378480
4  0.125294  0.532493  0.821694  0.355915  0.183869

In [937]:
df36['d'] > 0.5

0     True
1     True
2    False
3    False
4    False
Name: d, dtype: bool

In [938]:
df36['d'].where(df36['d'] > 0.5)

0    0.617478
1    0.671099
2         NaN
3         NaN
4         NaN
Name: d, dtype: float64

In [939]:
df36['d'].where(df36['d']>0.5,df36['d'].mean())

0    0.617478
1    0.671099
2    0.481031
3    0.481031
4    0.481031
Name: d, dtype: float64

In [940]:
df36['a'].where(df36['a']>.5)

0    0.645975
1         NaN
2         NaN
3         NaN
4         NaN
Name: a, dtype: float64

## dataframe.mask()
1.Pandas dataframe.mask() function return an object of same shape as self and whose corresponding entries are from self where condition is False and otherwise are from other object. 

2.The other object could be a callable. The mask method is an application of the if-then idiom.

3.Mask() function is exactly opposite of where() function.

4.means mask() function will make NaN whre condition is True and will get Values wher condition is False.

In [941]:
df36

          a         b         c         d         e
0  0.645975  0.594355  0.943314  0.617478  0.508472
1  0.227610  0.769437  0.347931  0.671099  0.746221
2  0.120658  0.549390  0.214769  0.479021  0.710810
3  0.414335  0.685167  0.520931  0.281643  0.378480
4  0.125294  0.532493  0.821694  0.355915  0.183869

In [942]:
df36.b >0.5

0    True
1    True
2    True
3    True
4    True
Name: b, dtype: bool

In [943]:
df36['b'].mask(df36.b >0.5)

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: b, dtype: float64

In [944]:
df36['b'] > 0.5

0    True
1    True
2    True
3    True
4    True
Name: b, dtype: bool

In [945]:
df36['b'].mask(df36['b'] > 0.5)

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: b, dtype: float64

In [946]:
df36[['b']].mask(df36[['b']] > 0.5)

    b
0 NaN
1 NaN
2 NaN
3 NaN
4 NaN

In [947]:
df36[['b','c']].mask(df36[['b','c']] > 0.5)

    b         c
0 NaN       NaN
1 NaN  0.347931
2 NaN  0.214769
3 NaN       NaN
4 NaN       NaN

In [948]:
df36['b'].mask(df36['b'] > 0.5)

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: b, dtype: float64

In [949]:
-df36['b']

0   -0.594355
1   -0.769437
2   -0.549390
3   -0.685167
4   -0.532493
Name: b, dtype: float64

In [950]:
df36['b'].mask(df36['b'] > 0.5,-df36['b'])

0   -0.594355
1   -0.769437
2   -0.549390
3   -0.685167
4   -0.532493
Name: b, dtype: float64

##### Example: 
Use mask() function to replace the values in the dataframe which are greater than 10 with -25.

In [951]:
df37 = pd.DataFrame({'A':[12,4,5,44,1],
                  'B':[5,2,54,3,2],
                  'C':[20,16,7,3,8],
                  'D':[14,3,17,2,6]})
df37

    A   B   C   D
0  12   5  20  14
1   4   2  16   3
2   5  54   7  17
3  44   3   3   2
4   1   2   8   6

In [952]:
df37.mask(df37>10,-25)

    A   B   C   D
0 -25   5 -25 -25
1   4   2 -25   3
2   5 -25   7 -25
3 -25   3   3   2
4   1   2   8   6

##### Example:
Use mask() function with a callable. Replace all the NaN value with 1000.

In [953]:
df38 = pd.DataFrame({'A':[12,4,5,None,44,1],
                  'B':[5,2,54,3,2,None],
                  'C':[20,16,7,None,3,8],
                  'D':[14,3,17,2,None,6]})
df38

      A     B     C     D
0  12.0   5.0  20.0  14.0
1   4.0   2.0  16.0   3.0
2   5.0  54.0   7.0  17.0
3   NaN   3.0   NaN   2.0
4  44.0   2.0   3.0   NaN
5   1.0   NaN   8.0   6.0

In [954]:
df38.mask(df38.isna(),1000)

        A       B       C       D
0    12.0     5.0    20.0    14.0
1     4.0     2.0    16.0     3.0
2     5.0    54.0     7.0    17.0
3  1000.0     3.0  1000.0     2.0
4    44.0     2.0     3.0  1000.0
5     1.0  1000.0     8.0     6.0

## dataframe.groupby()
Pandas dataframe.groupby() function is used to split the data into groups based on some criteria.

Pandas objects can be split on any of their axes. 

The abstract definition of grouping is to provide a mapping of labels to group names.

#### Splitting or Aggregations or Fiteration or Transformation

In [955]:
ipl_data = {'Team': ['MI', 'MI', 'Devils', 'Devils', 'Kings',
   'CSK', 'CSK', 'CSK', 'MI', 'Royals', 'Royals', 'MI'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df39 = pd.DataFrame(ipl_data)
df39

      Team  Rank  Year  Points
0       MI     1  2014     876
1       MI     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5      CSK     4  2015     812
6      CSK     1  2016     756
7      CSK     1  2017     788
8       MI     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11      MI     2  2017     690

#### i want the unique Team Names/find out total teams in dataset

In [956]:
df39.Team.unique()

array(['MI', 'Devils', 'Kings', 'CSK', 'Royals'], dtype=object)

In [957]:
df39['Team'].unique()

array(['MI', 'Devils', 'Kings', 'CSK', 'Royals'], dtype=object)

#### find out the total count (teamwise)

In [958]:
df39.Team.value_counts()

MI        4
CSK       3
Devils    2
Royals    2
Kings     1
Name: Team, dtype: int64

In [959]:
df39['Team'].value_counts()

MI        4
CSK       3
Devils    2
Royals    2
Kings     1
Name: Team, dtype: int64

In [960]:
df39[['Team']].value_counts()

Team
MI        4
CSK       3
Devils    2
Royals    2
Kings     1
dtype: int64

#### groupby on Team column

In [961]:
df39.groupby('Team')

In [962]:
list(df39.groupby('Team'))

[('CSK',
    Team  Rank  Year  Points
  5  CSK     4  2015     812
  6  CSK     1  2016     756
  7  CSK     1  2017     788),
 ('Devils',
       Team  Rank  Year  Points
  2  Devils     2  2014     863
  3  Devils     3  2015     673),
 ('Kings',
      Team  Rank  Year  Points
  4  Kings     3  2014     741),
 ('MI',
     Team  Rank  Year  Points
  0    MI     1  2014     876
  1    MI     2  2015     789
  8    MI     2  2016     694
  11   MI     2  2017     690),
 ('Royals',
        Team  Rank  Year  Points
  9   Royals     4  2014     701
  10  Royals     1  2015     804)]

In [963]:
for i in df39.groupby('Team'):
    print(i)
    print('\n')

('CSK',   Team  Rank  Year  Points
5  CSK     4  2015     812
6  CSK     1  2016     756
7  CSK     1  2017     788)


('Devils',      Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673)


('Kings',     Team  Rank  Year  Points
4  Kings     3  2014     741)


('MI',    Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690)


('Royals',       Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804)

#### if i want only team from a tuple

In [964]:
for i in df39.groupby('Team'):
    print(i[0])
    print('\n')

CSK


Devils


Kings


MI


Royals

#### if i want only team from a tuple

In [965]:
for team,data in df39.groupby('Team'):
    print(data)
    print('\n')

  Team  Rank  Year  Points
5  CSK     4  2015     812
6  CSK     1  2016     756
7  CSK     1  2017     788


     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673


    Team  Rank  Year  Points
4  Kings     3  2014     741


   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690


      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804

#### fetch data of only MI

In [966]:
for team,data in df39.groupby('Team'):
    if team=='MI':
        print(data)

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [967]:
df39.groupby('Team').get_group('MI')

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

#### it gives team name : index(where it is present)

In [968]:
df39.groupby('Team').groups

{'CSK': [5, 6, 7], 'Devils': [2, 3], 'Kings': [4], 'MI': [0, 1, 8, 11], 'Royals': [9, 10]}

#### i want mean() of year

In [969]:
df39.groupby('Year').mean()

      Rank  Points
Year
2014   2.5  795.25
2015   2.5  769.50
2016   1.5  725.00
2017   1.5  739.00

In [970]:
df39.groupby('Year').mean()['Points']

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

#### take sum of all points yearwise

In [971]:
df39.groupby('Year').sum()['Points']

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

#### Total teams 5

In [972]:
df39.groupby('Rank').groups

{1: [0, 6, 7, 10], 2: [1, 2, 8, 11], 3: [3, 4], 4: [5, 9]}

In [973]:
list(df39.groupby('Rank'))

[(1,
        Team  Rank  Year  Points
  0       MI     1  2014     876
  6      CSK     1  2016     756
  7      CSK     1  2017     788
  10  Royals     1  2015     804),
 (2,
        Team  Rank  Year  Points
  1       MI     2  2015     789
  2   Devils     2  2014     863
  8       MI     2  2016     694
  11      MI     2  2017     690),
 (3,
       Team  Rank  Year  Points
  3  Devils     3  2015     673
  4   Kings     3  2014     741),
 (4,
       Team  Rank  Year  Points
  5     CSK     4  2015     812
  9  Royals     4  2014     701)]

#### fetch only teams with rank 1

In [974]:
df39.groupby('Rank').get_group(1)

      Team  Rank  Year  Points
0       MI     1  2014     876
6      CSK     1  2016     756
7      CSK     1  2017     788
10  Royals     1  2015     804

#### fetch 1st entry of each category according to Team with Rank groupby

In [975]:
df39.groupby('Rank').first()

        Team  Year  Points
Rank
1         MI  2014     876
2         MI  2015     789
3     Devils  2015     673
4        CSK  2015     812

#### fetch last entry of each category according to Team with Rank groupby

In [976]:
df39.groupby('Rank').last()

        Team  Year  Points
Rank
1     Royals  2015     804
2         MI  2017     690
3      Kings  2014     741
4     Royals  2014     701

In [977]:
list(df39.groupby('Rank'))

[(1,
        Team  Rank  Year  Points
  0       MI     1  2014     876
  6      CSK     1  2016     756
  7      CSK     1  2017     788
  10  Royals     1  2015     804),
 (2,
        Team  Rank  Year  Points
  1       MI     2  2015     789
  2   Devils     2  2014     863
  8       MI     2  2016     694
  11      MI     2  2017     690),
 (3,
       Team  Rank  Year  Points
  3  Devils     3  2015     673
  4   Kings     3  2014     741),
 (4,
       Team  Rank  Year  Points
  5     CSK     4  2015     812
  9  Royals     4  2014     701)]

### Multiple column groupby

In [978]:
df39.groupby(['Team','Year']).groups

{('CSK', 2015): [5], ('CSK', 2016): [6], ('CSK', 2017): [7], ('Devils', 2014): [2], ('Devils', 2015): [3], ('Kings', 2014): [4], ('MI', 2014): [0], ('MI', 2015): [1], ('MI', 2016): [8], ('MI', 2017): [11], ('Royals', 2014): [9], ('Royals', 2015): [10]}

### Iterations over Group

#### Problem statement: Identify yearwise records  from whole dataset

In [979]:
grouped = df39.groupby('Year')
for v in grouped:
    print(v)
    print('\n')

(2014,      Team  Rank  Year  Points
0      MI     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701)


(2015,       Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804)


(2016,   Team  Rank  Year  Points
6  CSK     1  2016     756
8   MI     2  2016     694)


(2017,    Team  Rank  Year  Points
7   CSK     1  2017     788
11   MI     2  2017     690)

In [980]:
grouped = df39.groupby('Year')
for v in grouped:
    print(v[0])
    print('\n')

2014


2015


2016


2017

In [981]:
grouped = df39.groupby('Year')
for v in grouped:
    if v[0]==2017:
        print(v[1])

   Team  Rank  Year  Points
7   CSK     1  2017     788
11   MI     2  2017     690

### fetch record of 2015 without using groupby

In [982]:
df39.Year==2015 # Boolean Output

0     False
1      True
2     False
3      True
4     False
5      True
6     False
7     False
8     False
9     False
10     True
11    False
Name: Year, dtype: bool

In [983]:
df39[df39.Year==2015] # 2D Array

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

In [984]:
df39.query('Year==2015')

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

In [985]:
df39[df39.loc[:,'Year']==2015]

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

In [986]:
df39.groupby('Year').get_group(2015)

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

#### Selecting a perticular group

In [987]:
df39.groupby('Team').get_group('MI')

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

#### want to fetch the data of year =2014

In [988]:
df39.groupby('Year').get_group(2014)

     Team  Rank  Year  Points
0      MI     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

#### i want record of year 2017

In [989]:
df39.groupby('Year').get_group(2017)

   Team  Rank  Year  Points
7   CSK     1  2017     788
11   MI     2  2017     690

#### i want the team who stood 1st max times in ipl

In [990]:
df39.groupby('Rank').get_group(1).Team.value_counts()

CSK       2
MI        1
Royals    1
Name: Team, dtype: int64

### Aggregations #sum mean median mode std
### Aggregations work only on Numeric fields

In [991]:
grouped = df39.groupby('Year')
grouped['Points'].agg(np.sum)

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

#### #here size is nothing but occurance

In [992]:
grouped = df39.groupby('Team')
grouped.agg(np.size)

        Rank  Year  Points
Team
CSK        3     3       3
Devils     2     2       2
Kings      1     1       1
MI         4     4       4
Royals     2     2       2

In [993]:
df39.Team.value_counts()

MI        4
CSK       3
Devils    2
Royals    2
Kings     1
Name: Team, dtype: int64

#### Applying Multiple Aggregation Functions at Once

In [994]:
grouped = df39.groupby('Team')
grouped['Points'].agg([np.sum,np.mean, np.std])

         sum        mean         std
Team
CSK     2356  785.333333   28.095077
Devils  1536  768.000000  134.350288
Kings    741  741.000000         NaN
MI      3049  762.250000   88.567771
Royals  1505  752.500000   72.831998

In [995]:
grouped = df39.groupby('Team')
list(grouped['Rank'])

[('CSK',
  5    4
  6    1
  7    1
  Name: Rank, dtype: int64),
 ('Devils',
  2    2
  3    3
  Name: Rank, dtype: int64),
 ('Kings',
  4    3
  Name: Rank, dtype: int64),
 ('MI',
  0     1
  1     2
  8     2
  11    2
  Name: Rank, dtype: int64),
 ('Royals',
  9     4
  10    1
  Name: Rank, dtype: int64)]

## Pandas.DataFrame.query()
Analyzing data requires a lot of filtering operations.

Pandas provide many methods to filter a Data frame and Dataframe.query() is one of them.

Syntax: DataFrame.query(expression, inplace=False,**kwargs)

**Note:** DataFrame.query() method only works if the column name doesn't have any empty spaces. so before applying the method, spaces in column names are replaced with '_'.

##### **Example: Single condition filtering**

In [996]:
import pandas as pd
df = pd.DataFrame({'A': range(1, 6),
                   'B': range(10, 0, -2),
                   'C': range(10, 15)})
df

   A   B   C
0  1  10  10
1  2   8  11
2  3   6  12
3  4   4  13
4  5   2  14

In [997]:
# Replacing Blank spaces with '_'

In [998]:
df.columns = [column.replace(' ','_') for column in df.columns]

In [999]:
df

   A   B   C
0  1  10  10
1  2   8  11
2  3   6  12
3  4   4  13
4  5   2  14

In [1000]:
df.query('A==4')

   A  B   C
3  4  4  13

In [1001]:
df.query('A > B')

   A  B   C
4  5  2  14

In [1002]:
df[df['A']==3]

   A  B   C
2  3  6  12

In [1003]:
#fetch the value from column B where value of column A==3

In [1004]:
df[df['A']==3]['B']

2    6
Name: B, dtype: int64

In [1005]:
df.query('A==3').B

2    6
Name: B, dtype: int64

In [1006]:
#fetch A and B where A==3

In [1007]:
df[df['A']==3][['A','B']]

   A  B
2  3  6

In [1008]:
df[df['A']==3][['B','A']]

   B  A
2  6  3

In [1009]:
df['A'] + df['B']

0    11
1    10
2     9
3     8
4     7
dtype: int64

In [1010]:
pd.eval('df.A+df.B')

0    11
1    10
2     9
3     8
4     7
dtype: int64

In [1011]:
df.eval('A+B')

0    11
1    10
2     9
3     8
4     7
dtype: int64

##### **Example: Multiple condition filtering**

### <font color=darkred>**data.query('Name of column1 == Expression1 and Name of column2 == Expression2 and Name of column3 == Expression3', inplace = True)**

In [1012]:
df.query('A==2 and B==4 and C==13',inplace=True)

In [1013]:
df

Empty DataFrame
Columns: [A, B, C]
Index: []